#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary><strong>Validation Output</strong></summary>

```<br />
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary><strong>Show Plan</strong></summary>

``` <br />
terraform
data.azurerm_client_config.current: Reading...
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto]
module.pubip.azurerm_public_ip.pubip: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/publicIPAddresses/pubip-twitter-auto]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNGZhMzFiNS00ZjVlLTQzYWYtYWMwOS1iMmI5M2Y0MjNkNmY7b2JqZWN0SWQ9MjBkYjVmZTItZjhiYy00Y2ZiLTg4YjQtZjVjYjlkMDMyNDA1O3N1YnNjcmlwdGlvbklkPWY5MGI0MTIxLTU3ZjEtNGRiNi1hZGU2LTNiMTJlYTkzMGE2Njt0ZW5hbnRJZD1lOTk0MDcyYi01MjNlLTRiZmUtODZlMi00NDJjNWUxMGIyNDQ=]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto]
module.cr.azurerm_container_registry.cr: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerRegistry/registries/crTwitterAuto]
module.nsg.azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerService/managedClusters/aks-twitter-auto]
module.snet.azurerm_subnet.snet: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto/subnets/snet-twitter-auto]
module.ni.azurerm_network_interface.ni: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto]
module.nisga.azurerm_network_interface_security_group_association.nisga: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto|/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]
data.azurerm_kubernetes_cluster.cluster: Reading...
data.azurerm_kubernetes_cluster.cluster: Read complete after 5s [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerService/managedClusters/aks-twitter-auto]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.cg.azurerm_container_group.cg will be created
  + resource "azurerm_container_group" "cg" {
      + dns_name_label              = "my-sonarqube"
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = [
          + {
              + port     = 9000
              + protocol = "TCP"
            },
        ]
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "eastus"
      + name                        = "mysonarcube"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "rg-twitter-auto"
      + restart_policy              = "OnFailure"
      + sku                         = "Standard"

      + container {
          + commands = (known after apply)
          + cpu      = 1
          + image    = "sonarqube:9.2.0-community"
          + memory   = 4
          + name     = "sonarqube"

          + ports {
              + port     = 9000
              + protocol = "TCP"
            }

          + volume {
              + empty_dir            = false
              + mount_path           = "/opt/sonarqube/data"
              + name                 = "sonarqube-data"
              + read_only            = false
              + share_name           = "mysonarqubedata"
              + storage_account_key  = (sensitive value)
              + storage_account_name = "mysonarqubestorage"
            }
          + volume {
              + empty_dir            = false
              + mount_path           = "/opt/sonarqube/extensions"
              + name                 = "sonarqube-extensions"
              + read_only            = false
              + share_name           = "mysonarqubedata"
              + storage_account_key  = (sensitive value)
              + storage_account_name = "mysonarqubestorage"
            }
          + volume {
              + empty_dir            = false
              + mount_path           = "/opt/sonarqube/logs"
              + name                 = "sonarqube-logs"
              + read_only            = false
              + share_name           = "mysonarqubedata"
              + storage_account_key  = (sensitive value)
              + storage_account_name = "mysonarqubestorage"
            }
        }
    }

  # module.helm.helm_release.kube-prometheus will be created
  + resource "helm_release" "kube-prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stackr"
      + namespace                  = "kube-public"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "36.2.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.ni.azurerm_network_interface.ni will be updated in-place
  ~ resource "azurerm_network_interface" "ni" {
        id                            = "/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto"
        name                          = "ni-twitter-auto"
        tags                          = {
            "Environment" = "Development"
        }
        # (9 unchanged attributes hidden)

      ~ ip_configuration {
            name                          = "Internal"
          - public_ip_address_id          = "/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/publicIPAddresses/pubip-twitter-auto" -> null
            # (5 unchanged attributes hidden)
        }
    }

  # module.pubip.azurerm_public_ip.pubip will be destroyed
  # (because azurerm_public_ip.pubip is not in configuration)
  - resource "azurerm_public_ip" "pubip" {
      - allocation_method       = "Static" -> null
      - ddos_protection_mode    = "VirtualNetworkInherited" -> null
      - id                      = "/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/publicIPAddresses/pubip-twitter-auto" -> null
      - idle_timeout_in_minutes = 4 -> null
      - ip_address              = "20.127.76.248" -> null
      - ip_tags                 = {} -> null
      - ip_version              = "IPv4" -> null
      - location                = "eastus" -> null
      - name                    = "pubip-twitter-auto" -> null
      - resource_group_name     = "rg-twitter-auto" -> null
      - sku                     = "Basic" -> null
      - sku_tier                = "Regional" -> null
      - tags                    = {
          - "Environment" = "Development"
        } -> null
      - zones                   = [] -> null
    }

  # module.sa.azurerm_storage_account.sa will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "mysonarqubestorage"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-twitter-auto"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
    }

  # module.ss.azurerm_storage_share.ss will be created
  + resource "azurerm_storage_share" "ss" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "mysonarqubedata"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "mysonarqubestorage"
      + url                  = (known after apply)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @cuatrosr, Action: `pull_request`, Workflow: `On Pull Request`*